app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Underwater Basketweaving"], ["room_number", 21], ["created_at", "2021-01-01 19:57:21.585292"], ["updated_at", "2021-01-01 19:57:21.585292"]]
---
    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 9], ["updated_at", "2021-01-02 16:56:21.582958"], ["id", 5]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))