app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Eric"], ["updated_at", "2020-12-06 19:33:55.143974"], ["id", 5]]